Item-8/manage_problems-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: manage problems-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: manage problems-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  manage problems-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/)
      - clickByXPath(//a[contains(text(),'Login')])
      - clickByID(username)
      - typeByID(username): "company1"
      - typeByID(password): "company1"
      - submitByID(credentials)
      - clickByXPath(//div[2])
      - clickByLinkText(Manage problems)
      - clickByLinkText(Create new problem)
      - clickByID(title)
      - typeByID(title): "test"
      - clickByID(statement)
      - typeByID(statement): "test"
      - clickByID(hint)
      - typeByID(hint): "test"
      - clickByName(save)
      - clickByLinkText(Next)
      - clickByLinkText(Edit)
      - clickByID(title)
      - clickByCSS(body)
      - typeByID(title): "edit"
      - clickByName(save)
      - clickByLinkText(Next)
      - clickByXPath((//a[contains(text(),'Delete')])[3])
      - clickByLinkText(Logout)

  manage problems-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.103 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/security/login.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/security/login.do'
            think-time: 0ms
            headers: {}
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/j_spring_security_check'
            method: POST
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/j_spring_security_check'
            think-time: 7899ms
            headers:
              Origin: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io'
              Content-Type: application/x-www-form-urlencoded
            body:
              password: company1
              username: company1
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/'
            think-time: 90ms
            headers:
              Origin: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io'
              Content-Type: application/x-www-form-urlencoded
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            think-time: 7177ms
            headers: {}
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/create.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/create.do'
            think-time: 7709ms
            headers: {}
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/edit.do'
            method: POST
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/edit.do'
            think-time: 8631ms
            headers:
              Origin: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io'
              Content-Type: application/x-www-form-urlencoded
            body:
              attachments: ''
              company: '274'
              finalMode: '0'
              hint: test
              id: '0'
              save: Save
              statement: test
              title: test
              version: '0'
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            think-time: 154ms
            headers:
              Origin: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io'
              Content-Type: application/x-www-form-urlencoded
            body:
              title: 'Acme Hacker Rank Co., Inc.'
              logo: 'https://i.imgur.com/7b8lu4b.png '
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            think-time: 6706ms
            headers: {}
            body:
              logo: 'https://i.imgur.com/7b8lu4b.png '
              title: 'Acme Hacker Rank Co., Inc.'
              d-16544-p: '2'
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/edit.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/edit.do'
            think-time: 2518ms
            headers: {}
            body:
              problemId: '65536'
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/edit.do'
            method: POST
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/edit.do'
            think-time: 6338ms
            headers:
              Origin: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io'
              Content-Type: application/x-www-form-urlencoded
            body:
              attachments: ''
              company: '274'
              finalMode: '0'
              hint: test
              id: '65536'
              save: Save
              statement: test
              title: edit
              version: '1'
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            think-time: 108ms
            headers:
              Origin: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io'
              Content-Type: application/x-www-form-urlencoded
            body:
              title: 'Acme Hacker Rank Co., Inc.'
              logo: 'https://i.imgur.com/7b8lu4b.png '
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/list.do'
            think-time: 2932ms
            headers: {}
            body:
              logo: 'https://i.imgur.com/7b8lu4b.png '
              title: 'Acme Hacker Rank Co., Inc.'
              d-16544-p: '2'
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/delete.do'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/problem/company/delete.do'
            think-time: 1811ms
            headers: {}
            body:
              problemId: '65536'
          - url: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/j_spring_security_logout'
            method: GET
            label: 'http://app-0a205093-348f-4705-8c86-d62a99b2592f.cleverapps.io/j_spring_security_logout'
            think-time: 3536ms
            headers: {}